---
kind: type
id: T:Autodesk.Revit.DB.Profile
source: html/7837da2e-456d-7ef2-d5d1-76d7d3e7f9b3.htm
---
# Autodesk.Revit.DB.Profile

A geometric profile consisting of a loop of curves.

## Syntax (C#)
```csharp
public class Profile : GeometryObject
```

## Remarks
The profile may be filled.